app/Controllers/EmprestimoController.php

    public function index()
    {
        $usuarioModel = new UsuarioModel();
        $livroModel   = new LivroModel();

        $dados['emprestimos']     = $this->emprestimoModel->findAll();
        $dados['usuarios_lista']  = $usuarioModel->findAll();
        $dados['livros_lista']    = $livroModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`

    public function editar($id = null)
    {
        $usuarioModel = new UsuarioModel();
        $livroModel   = new LivroModel();

        $dados['emprestimo']      = $this->emprestimoModel->find($id);
        $dados['usuarios_lista']  = $usuarioModel->findAll();
        $dados['livros_lista']    = $livroModel->findAll();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '1'
SELECT *
FROM `usuario`
SELECT *
FROM `livro`

    public function atualizar()
    {
        $id = $this->request->getPost('id');
        $dataFim = $this->request->getPost('data_fim');

        $dadosFormulario = [
            'data_inicio'      => $this->request->getPost('data_inicio'),
            'data_fim'         => !empty($dataFim) ? $dataFim : null,
            'id_livro'         => $this->request->getPost('id_livro'),
            'id_usuario'       => $this->request->getPost('id_usuario'),
            'id_bibliotecario' => $this->request->getPost('id_bibliotecario'),
        ];

        if ($this->emprestimoModel->update($id, $dadosFormulario) === false) {
---
UPDATE `emprestimo` SET `data_inicio` = '4242-02-09', `data_fim` = '4244-02-04', `id_livro` = '1', `id_usuario` = '535350535', `id_bibliotecario` = '1'
WHERE `emprestimo`.`id` IN ('1')