app/Controllers/LivroController.php

SELECT *
FROM `livro`
---
    public function index()
    {
        $dados['livros'] = $this->livroModel->findAll();

SELECT *
FROM `livro`
WHERE `livro`.`id` = '1'
---
    public function editar($id = null)
    {
        $dados['livro'] = $this->livroModel->find($id);

UPDATE `livro` SET `isbn` = '324', `paginas` = '56', `ano` = '2059', `id_obra` = '424242', `id_editora` = '3232323'
WHERE `livro`.`id` IN ('1')
---
    public function atualizar()
    {
        $id = $this->request->getPost('id');

        $dadosFormulario = [
            'isbn'       => $this->request->getPost('isbn'),
            'paginas'    => $this->request->getPost('paginas'),
            'ano'        => $this->request->getPost('ano'),
            'id_obra'    => $this->request->getPost('id_obra'),
            'id_editora' => $this->request->getPost('id_editora'),
        ];

        if ($this->livroModel->update($id, $dadosFormulario) === false) {