app/Controllers/TipoUsuarioController.php

    public function index()
    {
        $data = [
            'tipos' => $this->tipoUsuarioModel->findAll()
        ];
---
SELECT *
FROM `tipo_usuario`