app/Controllers/UsuarioController.php

SELECT *
FROM `usuario`
SELECT *
FROM `tipo_usuario`
---
    public function index()
    {
        $data = [
            'usuarios' => $this->usuarioModel->findAll(),
            'tipos'    => $this->tipoUsuarioModel->findAll(),
        ];